tutorials/generatingProperties/forPureSpecies.SRK/constant/reactions
species
(
    O2
);

reactions
{
/*
    methaneReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "N2 = N2";
        A        1e-30;
        beta     0;
        Ta       14906;
    }
*/
}
