tutorials/generatingProperties/forPureSpecies.SRK/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    //mixture         SRKchungKineticReactingMixture;
    mixture         SRKchungTakaReactingMixture;
    //transport       chungKinetic;
    transport       chungTaka;
    thermo          rfJanaf;
    energy          sensibleEnthalpy;
    equationOfState soaveRedlichKwong;
    specie          rfSpecie;
}

inertSpecie O2;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.inputData";


// ************************************************************************* //
